;---------------------------------------------------------------------------------------
;   FILE:   XcomLoco   by RustyDios                               
;	File created 	24/11/19	02:45	LAST UPDATED    22/08/24    04:15
;
;*******************************************************************************************

;*********************
;Abilities - Adjusted
;*********************

[MZFireThrowerOverwatchShot X2AbilityTemplate]
LocFriendlyName="喷射器监视"

[MZChemthrowerKillZoneShot X2AbilityTemplate]
LocFriendlyName="喷射器死亡地带"

[MZChemstormIce X2AbilityTemplate]
LocFriendlyName="冰霜风暴"
LocLongDescription="使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一个完整圆圈内的所有单位."
LocHelpText="使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一个完整圆圈内的所有单位."
LocFlyOverText="冰霜风暴"

;********************
;Abilities - New
;********************

[RDThrowerShot_Fire X2AbilityTemplate]
LocFriendlyName="火焰喷射器"
LocLongDescription="喷出一股高度易燃的化学物质，燃烧并伤害多个目标。"
LocHelpText="喷出一股高度易燃的化学物质，燃烧并伤害多个目标。"
LocFlyOverText="火焰喷射器"
LocPromotionPopupText="<Bullet/>喷出一股高度易燃的化学物质，燃烧并损坏多个目标。"

[RDThrowerShot_Acid X2AbilityTemplate]
LocFriendlyName="酸液喷射器"
LocLongDescription="喷出一股高腐蚀性化学物质，烧毁并撕碎多个目标。"
LocHelpText="喷出一股高腐蚀性化学物质，烧毁并撕碎多个目标。"
LocFlyOverText="酸液喷射器"
LocPromotionPopupText="<Bullet/>喷出一股高腐蚀性化学物质，烧毁并撕碎多个目标。"

[RDThrowerShot_Poison X2AbilityTemplate]
LocFriendlyName="毒液喷射器"
LocLongDescription="喷出一股剧毒化学物质，毒害多个目标。刺穿护甲。"
LocHelpText="喷出一股剧毒化学物质，毒害多个目标。刺穿护甲。"
LocFlyOverText="毒液喷射器"
LocPromotionPopupText="<Bullet/>喷出一股剧毒化学物质，毒害多个目标。刺穿护甲。"

[RDThrowerShot_Hydro X2AbilityTemplate]
LocFriendlyName="寒霜喷射器"
LocLongDescription="喷出一股高度冷冻的化学物质，可能会冻结多个目标。导致目标轻微破裂。"
LocHelpText="喷出一股高度冷冻的化学物质，可能会冻结多个目标。导致目标轻微破裂。"
LocFlyOverText="寒霜喷射器"
LocPromotionPopupText="<Bullet/>喷出一股高度冷冻的化学物质，可能会冻结多个目标。导致目标轻微破裂。"

[RDThrowerOverwatchShot_Fire X2AbilityTemplate]
LocFriendlyName="火焰喷射器"

[RDThrowerOverwatchShot_Acid X2AbilityTemplate]
LocFriendlyName="酸液喷射器"

[RDThrowerOverwatchShot_Poison X2AbilityTemplate]
LocFriendlyName="毒液喷射器"

[RDThrowerOverwatchShot_Hydro X2AbilityTemplate]
LocFriendlyName="寒霜喷射器"

[RDChemstorm_Acid X2AbilityTemplate]
LocFriendlyName="酸性风暴"
LocLongDescription="使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一圈内的所有单位。"
LocHelpText="使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一圈内的所有单位。"
LocFlyOverText="酸性风暴"
LocPromotionPopupText="<Bullet/>使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一圈内的所有单位。<br/><Bullet/>消耗<Ability:CHEMSTORM_AMMO/>弹药。<br/><Bullet/>有<Ability:CHEMSTORM_COOL/>回合冷却时间。<br/><Bullet/>范围为<Ability:CHEMSTORM_RADIUS/>格子。"

[RDChemstorm_Poison X2AbilityTemplate]
LocFriendlyName="毒液风暴"
LocLongDescription="使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一圈内的所有单位。"
LocHelpText="使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一圈内的所有单位。"
LocFlyOverText="毒液风暴"
LocPromotionPopupText="<Bullet/>使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一圈内的所有单位。<br/><Bullet/>消耗<Ability:CHEMSTORM_AMMO/>弹药。<br/><Bullet/>有<Ability:CHEMSTORM_COOL/>回合冷却时间。<br/><Bullet/>范围为<Ability:CHEMSTORM_RADIUS/>格子。"

[RDChemstorm_Frost X2AbilityTemplate]
LocFriendlyName="冰冻风暴"
LocLongDescription="使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一圈内的所有单位。"
LocHelpText="使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一圈内的所有单位。"
LocFlyOverText="冰冻风暴"
LocPromotionPopupText="<Bullet/>使用<Ability:WeaponName/>攻击<Ability:ClassName/>位置周围一圈内的所有单位。<br/><Bullet/>消耗<Ability:CHEMSTORM_AMMO/>弹药。<br/><Bullet/>有<Ability:CHEMSTORM_COOL/>回合冷却时间。<br/><Bullet/>范围为<Ability:CHEMSTORM_RADIUS/>格子。"

[RDChemthrower_DirectJet X2AbilityTemplate]
LocFriendlyName="定向喷射"
LocLongDescription="沿直线使用 <Ability:WeaponName/>。该喷射流是高压爆炸，具有很大的破坏力。必定命中！"
LocHelpText="沿直线使用 <Ability:WeaponName/>。该喷射流是高压爆炸，具有很大的破坏力。必定命中！"
LocFlyOverText="定向喷射"

[RDChemthrower_LargeWall X2AbilityTemplate]
LocFriendlyName="爆发"
LocLongDescription="在短小紧凑的区域使用<Ability:WeaponName/>。这道力墙是一种高压爆炸，具有很大的破坏力。必定命中！"
LocHelpText="在短小紧凑的区域内使用<Ability:WeaponName/>。这道力墙是一种高压爆炸，具有很大的破坏力。必定命中！"
LocFlyOverText="爆发"

[RDChemthrower_ArcCutter X2AbilityTemplate]
LocFriendlyName="弧形切割器"
LocLongDescription="使用 <Ability:WeaponName/> 引爆火焰来撕碎装甲，同时对目标造成伤害。近战攻击。\n对机器人单位造成额外伤害，并有机会强制关闭。"
LocHelpText="使用<Ability:WeaponName/>引爆火焰来撕碎装甲，同时对目标造成伤害。近战攻击。\n对机器人单位造成额外伤害，并有机会强制关闭。"
LocFlyOverText="弧形切割器"

;VARIANTS WITH FROST TRACKING FOR PERK FX
[RDChemthrower_DirectJet_F X2AbilityTemplate]
LocFriendlyName="定向喷射"
LocLongDescription="沿直线使用 <Ability:WeaponName/>。该喷射流是高压爆炸，具有很大的破坏力。必定命中！"
LocHelpText="沿直线使用 <Ability:WeaponName/>。该喷射流是高压爆炸，具有很大的破坏力。必定命中！"
LocFlyOverText="定向喷射"

[RDChemthrower_LargeWall_F X2AbilityTemplate]
LocFriendlyName="爆发"
LocLongDescription="在短小紧凑的区域使用<Ability:WeaponName/>。这道力墙是一种高压爆炸，具有很大的破坏力。必定命中！"
LocHelpText="在短小紧凑的区域内使用<Ability:WeaponName/>。这道力墙是一种高压爆炸，具有很大的破坏力。必定命中！"
LocFlyOverText="爆发"

[RDChemthrower_ArcCutter_F X2AbilityTemplate]
LocFriendlyName="弧形切割器"
LocLongDescription="使用 <Ability:WeaponName/> 引爆火焰来撕碎装甲，同时对目标造成伤害。近战攻击。\n对机器人单位造成额外伤害，并有机会强制关闭。"
LocHelpText="使用<Ability:WeaponName/>引爆火焰来撕碎装甲，同时对目标造成伤害。近战攻击。\n对机器人单位造成额外伤害，并有机会强制关闭。"
LocFlyOverText="弧形切割器"

；********************
；武器 - 已调整
；********************

[XComCryolator_CV X2WeaponTemplate]
FriendlyName="冰霜喷射器"
FriendlyNamePlural="冰霜喷射器"

[MZImmolator_CV X2WeaponTemplate]
FriendlyName="化学喷射器"
FriendlyNamePlural="化学喷射器"

[XCOM_Xenolator_CV X2WeaponTemplate]
FriendlyName="生锈的火焰喷射器"
FriendlyNamePlural="生锈的火焰喷射器"

[XCOM_Xenolator_MG X2WeaponTemplate]
FriendlyName="生锈的火焰喷射器"
FriendlyNamePlural="生锈的火焰喷射器"

[XCOM_Xenolator_BM X2WeaponTemplate]
FriendlyName="生锈的火焰喷射器"
FriendlyNamePlural="生锈的火焰喷射器"

[XCOM_Xenolator_AC X2WeaponTemplate]
FriendlyName="生锈的 酸液喷射器"
FriendlyNamePlural="生锈的 酸液喷射器"

[XCOM_Xenolator_PO X2WeaponTemplate]
FriendlyName="生锈的毒液喷射器"
FriendlyNamePlural="生锈的毒液喷射器"

；********************
；武器 - 新型
；********************

[RDCHEM_XENO_CV X2WeaponTemplate]
FriendlyName="火焰喷射器"
FriendlyNamePlural="火焰喷射器"
BriefSummary="这种基本的化学喷射器可以发射一股高度易燃的化学物质，烧伤并损坏多个目标。"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此仅在对付多个目标时才有效。<br><Bullet/> 火焰喷射器 会一直灼烧目标，造成持续伤害并禁用某些能力。<br><Bullet/> 一些敌人可能对火焰免疫，不会受到 火焰喷射器 的伤害。<br><Bullet/> 对迷失者非常有效。<br>"
AbilityDescName="火焰喷射器"

[RDCHEM_XENO_MG X2WeaponTemplate]
FriendlyName="高级火焰喷射器"
FriendlyNamePlural="高级火焰喷射器"
BriefSummary="这种先进的化学喷射器可以发射一股高度易燃的化学物质，烧伤并损坏多个目标。"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此仅在对付多个目标时才有效。<br><Bullet/> 火焰喷射器 会一直灼烧目标，造成持续伤害并禁用某些能力。<br><Bullet/> 一些敌人可能对火焰免疫，不会受到 火焰喷射器 的伤害。<br><Bullet/> 对迷失者非常有效。<br>"
AbilityDescName="火焰喷射器"

[RDCHEM_XENO_BM X2WeaponTemplate]
FriendlyName="终级火焰喷射器"
FriendlyNamePlural="终级火焰喷射器"
BriefSummary="这种终级化学喷射器可以发射一股高度易燃的化学物质，烧伤并损坏多个目标。"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此仅在对付多个目标时才有效。<br><Bullet/> 火焰喷射器 会一直灼烧目标，造成持续伤害并禁用某些能力。<br><Bullet/> 一些敌人可能对火焰免疫，不会受到 火焰喷射器 的伤害。<br><Bullet/> 对迷失者非常有效。<br>"
AbilityDescName="火焰喷射器"

[RDCHEM_ACID_CV X2WeaponTemplate]
FriendlyName="酸液喷射器"
FriendlyNamePlural="酸液喷射器"
BriefSummary="这种独特的化学喷射器可以发射一股高腐蚀性化学物质，烧伤并损坏多个目标。"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此只有在对付多个目标时才有效。<br><Bullet/> 酸液喷射器 会一直融化目标，造成持续伤害并撕碎护甲。<br><Bullet/> 有些敌人可能对酸免疫，不会受到 酸液喷射器 的伤害。<br><Bullet/>这种化学喷射器极难操作，其效果可能会达到意想不到的区域。<br>"
AbilityDescName="酸液喷射器"

[RDCHEM_ACID_MG X2WeaponTemplate]
FriendlyName="高级酸液喷射器"
FriendlyNamePlural="高级酸液喷射器"
BriefSummary="这种独特的化学喷射器可以发射一股高腐蚀性化学物质，烧伤并损坏多个目标。"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此只有在对付多个目标时才有效。<br><Bullet/> 酸液喷射器 会一直融化目标，造成持续伤害并撕碎护甲。<br><Bullet/> 有些敌人可能对酸免疫，不会受到 酸液喷射器 的伤害。<br><Bullet/>这种化学喷射器极难操作，其效果可能会达到意想不到的区域。<br>"
AbilityDescName="酸液喷射器"

[RDCHEM_ACID_BM X2WeaponTemplate]
FriendlyName="终级酸液喷射器"
FriendlyNamePlural="终级酸液喷射器"
BriefSummary="这种独特的化学喷射器可以发射一股高腐蚀性化学物质，烧伤并损坏多个目标。"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此只有在对付多个目标时才有效。<br><Bullet/> 酸液喷射器 会一直融化目标，造成持续伤害并撕碎护甲。<br><Bullet/> 有些敌人可能对酸免疫，不会受到 酸液喷射器 的伤害。<br><Bullet/>这种化学喷射器极难操作，其效果可能会达到意想不到的区域。<br>"
AbilityDescName="酸液喷射器"

[RDCHEM_POISON_CV X2WeaponTemplate]
FriendlyName="毒液喷射器"
FriendlyNamePlural="毒液喷射器"
BriefSummary="这种独特的化学喷射器可以发射一股剧毒化学物质，毒害和伤害多个目标。"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此只有在对付多个目标时才有效。<br><Bullet/> 毒气喷射器会一直毒害目标，造成持续伤害并且无视护甲。<br><Bullet/> 一些敌人可能对毒液喷射器免疫，不会受到毒气喷射器的伤害。<br><Bullet/>这种化学喷射器极难操作，其效果可能会到达意想不到的区域。<br>"
AbilityDescName="毒液喷射器"

[RDCHEM_POISON_MG X2WeaponTemplate]
FriendlyName="高级毒液喷射器"
FriendlyNamePlural="高级毒液喷射器"
BriefSummary="这种独特的化学喷射器可以发射一股剧毒化学物质，毒害和伤害多个目标。"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此只有在对付多个目标时才有效。<br><Bullet/> 毒气喷射器会一直毒害目标，造成持续伤害并且无视护甲。<br><Bullet/> 一些敌人可能对毒液喷射器免疫，不会受到毒气喷射器的伤害。<br><Bullet/>这种化学喷射器极难操作，其效果可能会到达意想不到的区域。<br>"
AbilityDescName="毒液喷射器"

[RDCHEM_POISON_BM X2WeaponTemplate]
FriendlyName="终级毒液喷射器"
FriendlyNamePlural="终级毒液喷射器"
BriefSummary="这种独特的化学喷射器可以发射一股剧毒化学物质，毒害和伤害多个目标。"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此只有在对付多个目标时才有效。<br><Bullet/> 毒气喷射器会一直毒害目标，造成持续伤害并且无视护甲。<br><Bullet/> 一些敌人可能对毒液喷射器免疫，不会受到毒气喷射器的伤害。<br><Bullet/>这种化学喷射器极难操作，其效果可能会到达意想不到的区域。<br>"
AbilityDescName="毒液喷射器"

[RDCHEM_HYDRO_CV X2WeaponTemplate]
FriendlyName="寒霜喷射器"
FriendlyNamePlural="寒霜喷射器"
BriefSummary="这种独特的化学喷射器可以发射一股高度冷冻的化学物质，冻结、破裂并损坏多个目标。包括你自己！"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此只有在对付多个目标时才有效。<br><Bullet/> 寒霜喷射器有机会冻结和破坏目标，造成持续伤害并且无视护甲。<br><Bullet/> 一些敌人可能对冰霜免疫，不会受到寒霜喷射器的伤害。<br><Bullet/> 这种化学喷射器极难操作，其效果可能会达到意想不到的区域。<br>"
AbilityDescName="寒霜喷射器"

[RDCHEM_HYDRO_MG X2WeaponTemplate]
FriendlyName="高级寒霜喷射器"
FriendlyNamePlural="高级寒霜喷射器"
BriefSummary="这种独特的化学喷射器可以发射一股高度冷冻的化学物质，冻结、破裂并损坏多个目标。包括你自己！"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此只有在对付多个目标时才有效。<br><Bullet/> 寒霜喷射器有机会冻结和破坏目标，造成持续伤害并且无视护甲。<br><Bullet/> 一些敌人可能对冰霜免疫，不会受到寒霜喷射器的伤害。<br><Bullet/> 这种化学喷射器极难操作，其效果可能会达到意想不到的区域。<br>"
AbilityDescName="寒霜喷射器"

[RDCHEM_HYDRO_BM X2WeaponTemplate]
FriendlyName="终级寒霜喷射器"
FriendlyNamePlural="终极寒霜喷射器"
BriefSummary="这种独特的化学喷射器可以发射一股高度冷冻的化学物质，冻结、破裂并损坏多个目标。包括你自己！"
TacticalText="<Bullet/> 化学喷射器在广阔区域内造成的伤害较低，因此只有在对付多个目标时才有效。<br><Bullet/> 寒霜喷射器有机会冻结和破坏目标，造成持续伤害并且无视护甲。<br><Bullet/> 一些敌人可能对冰霜免疫，不会受到寒霜喷射器的伤害。<br><Bullet/> 这种化学喷射器极难操作，其效果可能会达到意想不到的区域。<br>"
AbilityDescName="寒霜喷射器"

；********************
; 技术 - 新
；********************

[ExperimentalChemthrowers_CV X2TechTemplate]
DisplayName="实验性化学喷射器：基础"
CodeName="化学喷射器"
Summary="我们可能已经看到外星人和变种人在他们的武器中使用了一些奇异的化学物质。凭借我们目前在制造和改造武器方面的经验，我们可以开发出与默认模型不同的新型化学喷射器。\n这些新型化学喷射器将以火、冰、毒液喷射器或酸为基础。"
LongDescription="我们可能已经看到外星人和变种人在他们的武器中使用了一些奇异的化学物质。凭借我们目前制造和改造武器的经验，我们可以开发出与默认模型不同的新型化学喷射器。\n这些新型化学喷射器将以火、冰、毒液喷射器或酸为基础。"
UnlockedDescription="我们可以尝试修改我们的化学喷射器来创造元素变体"

[ExperimentalChemthrowers_MG X2TechTemplate]
DisplayName="实验性化学喷射器：高级"
CodeName="化学喷射器"
Summary="我们可能已经看到外星人和变种人在他们的武器中使用了一些奇异的化学物质。凭借我们目前在制造和改造武器方面的经验，我们可以开发出与默认模型不同的新型化学喷射器。\n这些新型化学喷射器将以火、冰、毒液喷射器或酸为基础。"
LongDescription="我们可能已经看到外星人和变种人在他们的武器中使用了一些奇异的化学物质。凭借我们目前制造和改造武器的经验，我们可以开发出与默认模型不同的新型化学喷射器。\n这些新型化学喷射器将以火、冰、毒液喷射器或酸为基础。"
UnlockedDescription="我们可以尝试修改我们的化学喷射器来创造元素变体"

[ExperimentalChemthrowers_BM X2TechTemplate]
DisplayName="实验性化学喷射器：终级"
CodeName="化学喷射器"
Summary="我们可能已经看到外星人和变种人在他们的武器中使用了一些奇异的化学物质。凭借我们目前在制造和改造武器方面的经验，我们可以开发出与默认模型不同的新型化学喷射器。\n这些新型化学喷射器将以火、冰、毒液喷射器或酸为基础。"
LongDescription="我们可能已经看到外星人和变种人在他们的武器中使用了一些奇异的化学物质。凭借我们目前制造和改造武器的经验，我们可以开发出与默认模型不同的新型化学喷射器。\n这些新型化学喷射器将以火、冰、毒液喷射器或酸为基础。"
UnlockedDescription="我们可以尝试修改我们的化学喷射器来创造元素变体"

[ExperimentalCanisters X2TechTemplate]
DisplayName="实验罐"
CodeName="生锈六边形"
Summary="我们可能已经看到外星人和变种人在他们的武器中使用了一些奇异的化学物质。凭借我们目前在制造和改造武器方面的经验，我们可以开发出与默认模型不同的新型罐。\n这些新罐将基于火、冰、毒、酸、电、灵能、爆炸物、烟雾或医疗。\n\n<font color = '#5CC3C1'>*****</font>\n<font color = '#5CC3C1'>冰罐需要寒霜协议。</font>"
LongDescription="我们可能已经看到外星人和变种人在他们的武器中使用了一些奇异的化学物质。凭借我们目前在制造和改造武器方面的经验，我们可以开发出与默认模型不同的新型罐。\n这些新罐将基于火、冰、毒、酸、电、灵能、爆炸物、烟雾或医疗。\n\n<font color = '#5CC3C1'>*****</font>\n<font color = '#5CC3C1'>冰罐需要寒霜协议。</font>"
UnlockedDescription="我们可以尝试修改我们的罐子来创造元素变体"

；********************
；PGOv2
；********************

[MZBlastCanister_UnlockTech X2TechTemplate]
DisplayName="实验：爆破罐"
Summary="我们制造了一个变体罐。"

[MZFireCanister_UnlockTech X2TechTemplate]
DisplayName="实验：燃烧罐"
Summary="我们制造了一个变体罐。"

[MZIceCanister_UnlockTech X2TechTemplate]
DisplayName="实验：冰霜罐"
Summary="我们制造了一个变体罐。"

[MZPoisonCanister_UnlockTech X2TechTemplate]
DisplayName="实验：毒液罐"
Summary="我们制造了一个变体罐。"

[MZAcidCanister_UnlockTech X2TechTemplate]
DisplayName="实验：酸液罐"
Summary="我们制造了一个变体罐。"

[MZCurseCanister_UnlockTech X2TechTemplate]
DisplayName="实验：诅咒罐"
Summary="我们制造了一个变体罐。"

[MZSmokeCanister_UnlockTech X2TechTemplate]
DisplayName="实验：烟雾罐"
Summary="我们制造了一个变体罐。"

[MZMedicCanister_UnlockTech X2TechTemplate]
DisplayName="实验：医疗罐"
Summary="我们制造了一个变体罐。"

[MZBluescreenCanister_UnlockTech X2TechTemplate]
DisplayName="实验：蓝屏罐"
Summary="我们制造了一个变体罐。"

[RDCHEM_XENO_CV_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：火焰喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_XENO_MG_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：高级火焰喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_XENO_BM_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：终极火焰喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_ACID_CV_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：酸液喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_ACID_MG_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：高级酸液喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_ACID_BM_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：终极酸液喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_HYDRO_CV_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：寒霜喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_HYDRO_MG_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：高级寒霜喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_HYDRO_BM_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：终极寒霜喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_POISON_CV_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：毒液喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_POISON_MG_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：高级毒液喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[RDCHEM_POISON_BM_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：终极毒液喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[XComCryolator_CV_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：冰霜喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[XComCryolator_MG_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：高级冰霜喷射器"
Summary="我们制作了一种变种化学喷洒器。"

[XComCryolator_BM_UnlockTech X2TechTemplate]
DisplayName="实验喷射器：终极冰霜喷射器"
Summary="我们制作了一种变种化学喷洒器。"

;****************************************
; 附件升级 - 已调整
;****************************************

[MZWidthNozzle_Bsc X2WeaponUpgradeTemplate]
FriendlyName="广角喷嘴"
FriendlyNamePlural="广角喷嘴"

[MZLengthNozzle_Bsc X2WeaponUpgradeTemplate]
FriendlyName="高速喷嘴"
FriendlyNamePlural="高速喷嘴"

[MZClipSizeFuel_Bsc X2WeaponUpgradeTemplate]
FriendlyName="扩展油箱"
FriendlyNamePlural="扩展油箱"

[MZReloadFuel_Bsc X2WeaponUpgradeTemplate]
FriendlyName="应急油箱"
FriendlyNamePlural="应急油箱"

[MZReactionFireFrame_Bsc X2WeaponUpgradeTemplate]
FriendlyName="哨兵框架"
FriendlyNamePlural="哨兵框架"

[MZFlankCritFrame_Bsc X2WeaponUpgradeTemplate]
FriendlyName="先驱者框架"
FriendlyNamePlural="先驱者框架"

[MZFuelLine_Bsc X2WeaponUpgradeTemplate]
FriendlyName="燃料管道"
FriendlyNamePlural="燃料管道"

[MZFuelLine_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级燃料管道"
FriendlyNamePlural="高级燃料管道"

[MZFuelLine_Sup X2WeaponUpgradeTemplate]
FriendlyName="终级燃料管道"
FriendlyNamePlural="终级燃料管道"

;****************************************
; 插槽-确保匹配配置
;****************************************

[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]
m_strInventoryLabels[eInvSlot_SecondaryPayload]=CANISTER
